import React from "react";
import "./Contnet.css";

const Content = () => {
  return (
    <div className="content">
      <h2>রিঅ্যাক্ট কিভাবে কাজ করে?</h2>
      <p>
        রিঅ্যাক্ট ব্রাউজারের ডমের মতো করে আরেকটা ডম তৈরী করে যেটাকে ভার্চুয়াল ডম বলা হয়। রিঅ্যাক্ট এটাকে এমনভাবে তৈরী করে যে এই ডমের সাথে সহজেই
        জাভাস্ক্রিপ্ট ইউজ করে যেকোনো ইলিমেন্ট মডিফাই করা যায় কম সময়ের মধ্যে। এখন এখানেও রিঅ্যাক্ট আরেকটা কাজ করে। ইউজার ডমে কোনো চেঞ্জ আনার মতো কিছু
        করলে রিঅ্যাক্ট দুইটা ভার্চুয়াল ডমের মধ্যে একটাতে সেই চেঞ্জগুলো রাখে, আর আরেকটা থাকে আগের ভার্শনের। এখন আগেরটার সাথে নতুনটার তুলনা করে
        রিঅ্যাক্ট দেখে আসলে স্পেসেফিক ঠিক কোন ইলিমেন্ট পরিবর্তন করা হয়েছে। যেই জিনিসটা চেঞ্জ হয়েছে সেটাকেই চেঞ্জ করে। এতে সহজেই দ্রুত কাজ হয়ে যায় । আর
        এভাবেই, এই টেকনিক ইউজ করেই রিঅ্যাক্ট এতো ফাস্ট রেন্ডার করতে পারে।
      </p>
      <h2>প্রপস এবং স্টেটের মধ্যে পার্থক্য।</h2>
      <table>
        <thead>
          <th>প্রপস</th>
          <th>স্টেট</th>
        </thead>
        <tbody>
          <tr>
            <td>এটি অপরিবর্তনীয় (পরিবর্তন করা যাবে না)।</td>
            <td>এটি পরিবর্তনযোগ্য (পরিবর্তন করা যেতে পারে)।</td>
          </tr>
          <tr>
            <td>প্রপস শুধুমাত্র পঠনযোগ্য।</td>
            <td>স্টেট পঠিত এবং লিখিত উভয়।</td>
          </tr>
          <tr>
            <td>ডেটা এক উপাদান থেকে অন্য উপাদানে প্রেরণ করা হয়।</td>
            <td>তথ্য শুধুমাত্র উপাদান মধ্যে পাস করা হয়।</td>
          </tr>
          <tr>
            <td>উপাদানগুলির সাথে প্রপস ব্যবহার করা যেতে পারে।</td>
            <td>স্টেট শুধুমাত্র স্টেট কম্পোনেন্ট/ক্লাস কম্পোনেন্টের সাথে ব্যবহার করা যেতে পারে।</td>
          </tr>
        </tbody>
      </table>
    </div>
  );
};

export default Content;
